src/cf/Catalogs/Этапы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<Name>Этапы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<BasedOn>
				<xr:Item>Catalog.Спринты</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Спринт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Спринты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Цели</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПоказателиУспеха</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Показатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПоказателиУспеха</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Documents/КлючевыеЗадачи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Document>
		<Properties>
			<Name>КлючевыеЗадачи</Name>
			<BasedOn>
				<xr:Item>Catalog.Этапы</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Название</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Этапы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Этап</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Этапы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеЭтапа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Коментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Цели</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цвет</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Картинка</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаследоватьЦветЦели</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗадач</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/Catalogs/Этапы/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(Объект.Ссылка)  Тогда
		Возврат;	
	КонецЕсли;
	
	КлючевыеЗадачи = ПолучитьКлючевыеЗадачиНаСервере(Объект.Ссылка);
	
	Если КлючевыеЗадачи.Количество() = 0 Тогда
		Возврат;	
	КонецЕсли;
	
	НомерКлючеойЗадачи = 0;
	Для каждого Задача Из КлючевыеЗадачи Цикл
		НомерКлючеойЗадачи = НомерКлючеойЗадачи + 1;
		ДобаитьРеквизитФормы(Задача.Ссылка,НомерКлючеойЗадачи);
	
	КонецЦикла;
	
	
КонецПроцедуры



&НаСервере
Функция ПолучитьКлючевыеЗадачиНаСервере(Ссылка)
	
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КлючевыеЗадачи.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.КлючевыеЗадачи КАК КлючевыеЗадачи
		|ГДЕ
		|	КлючевыеЗадачи.Основание = &Основание";
	
	Запрос.УстановитьПараметр("Основание", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить();
	

	

КонецФункции // ()

&НаСервере
Процедура ДобаитьРеквизитФормы(СсылкаНаЭтап,НомерКлючевойЗадачи)
	
	ДобавляемыеРеквизиты = Новый Массив;
	
	ТипРеквизита = Новый ОписаниеТипов("ДокументСсылка.КлючевыеЗадачи");
	
	РеквизитФормы = Новый РеквизитФормы(
		"КлючеваяЗадача_"+Строка(НомерКлючевойЗадачи),  //Имя реквизита формы
		ТипРеквизита,     //Тип
		"",               //Путь  (Пусто, "Объект", ИмяТЧ)
						  // например "Объект.Товары"	
		Строка(НомерКлючевойЗадачи)+". " + Строка(СсылкаНаЭтап.Название));//Заголовок
						  							 
	ДобавляемыеРеквизиты.Добавить(РеквизитФормы);
	
	//Заставляем форму создать новые реквизиты
	ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	//Обращение к реквизиту формы из кода
	ЭтаФорма["КлючеваяЗадача_"+Строка(НомерКлючевойЗадачи)] = СсылкаНаЭтап;
		
	//Вывод реквизита на форму (при необходимости)
	ПолеВвода = Элементы.Добавить("КлючеваяЗадача_"+Строка(НомерКлючевойЗадачи), Тип("ПолеФормы"), Элементы.ГруппаКлючевыхЗадач);
	ПолеВвода.Вид = ВидПоляФормы.ПолеНадписи;
	ПолеВвода.Гиперссылка = Истина;
	ПолеВвода.ПутьКДанным = "КлючеваяЗадача_"+Строка(НомерКлючевойЗадачи);

	
	

КонецПроцедуры // ()

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если Не Объект.ПоказателиУспеха.Количество() Тогда
	
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не задано ни одного показателя успешного выполнения этапа!";
		Сообщение.Поле = "ПоказателиУспеха";
		Сообщение.УстановитьДанные(ТекущийОбъект);
		Сообщение.Сообщить();	
	    Отказ = Истина;
	КонецЕсли;
КонецПроцедуры
